Tekla.Structures.Model.Geometry.Rotation3D
Represents 3d rotation of object.

Tekla.Structures.Model.Geometry.Rotation3D.#ctor
Initializes a new instance of the Tekla.Structures.Model.Geometry.Rotation3D class.

Tekla.Structures.Model.Geometry.Rotation3D.#ctor(Tekla.Structures.Geometry3d.Vector,Tekla.Structures.Geometry3d.Vector)
Initializes a new instance of the Tekla.Structures.Model.Geometry.Rotation3D class.
axisX: The X direction, must be unit.
axisY: The Y direction, must be unit and perpendicular to axisX.

Tekla.Structures.Model.Geometry.Rotation3D.AxisX
Gets the X direction.

Tekla.Structures.Model.Geometry.Rotation3D.AxisY
Gets the Y direction.

Tekla.Structures.Model.Geometry.Rotation3D.AxisZ
Gets the Z direction.

Tekla.Structures.Model.Geometry.Rotation3D.FromZRotation(Tekla.Structures.Datatype.Angle)
Creates Tekla.Structures.Model.Geometry.Rotation3D which represents rotation around the Z axis.
angle: The rotation andle.
Returns: Tekla.Structures.Model.Geometry.Rotation3D instance whcih represents the Z rotation.

Tekla.Structures.Model.Geometry.Rotation3D.Equals(Tekla.Structures.Model.Geometry.Rotation3D,System.Double)
Compares with another rotation.
other: The other rotation.
tolerance: Comparison tolerance.
Returns: True if found equal, false otherwise.